var consume_datasource = [ {
	"id" : "1-A10001",
	"text" : "生活消费",
	"children" : [ {
		"id" : "2-AA0001/1-A10001",
		"text" : "餐饮消费"
	}, {
		"id" : "2-AB0001/1-A10001",
		"text" : "酒水消费"
	}, {
		"id" : "2-AC0001/1-A10001",
		"text" : "超市购物"
	}, {
		"id" : "2-AD0001/1-A10001",
		"text" : "电话费"
	}, {
		"id" : "2-AL0001/1-A10001",
		"text" : "网费"
	}, {
		"id" : "2-AE0001/1-A10001",
		"text" : "银行手续费"
	}, {
		"id" : "2-AF0001/1-A10001",
		"text" : "电影"
	}, {
		"id" : "2-AG0001/1-A10001",
		"text" : "房租"
	}, {
		"id" : "2-AH0001/1-A10001",
		"text" : "服务费（按摩、理疗、剪头发）"
	}, {
		"id" : "2-AI0001/1-A10001",
		"text" : "其它消费"
	}, {
		"id" : "2-AJ0001/1-A10001",
		"text" : "咖啡（星巴克）"
	}, {
		"id" : "2-AK0001/1-A10001",
		"text" : "药"
	}, {
		"id" : "2-AM0001/1-A10001",
		"text" : "快递"
	}, {
		"id" : "2-AN0001/1-A10001",
		"text" : "证件照"
	}, {
		"id" : "2-AO0001/1-A10001",
		"text" : "水电费"
	}, {
		"id" : "2-AP0001/1-A10001",
		"text" : "体育用品"
	}, {
		"id" : "2-ALK0001/1-A10001",
		"text" : "网上支付"
	} ]
}, {
	"id" : "1-B10001",
	"text" : "交通消费",
	"children" : [ {
		"id" : "2-BA0001/1-B10001",
		"text" : "火车票"
	}, {
		"id" : "2-BB0001/1-B10001",
		"text" : "汽车票"
	}, {
		"id" : "2-BC0001/1-B10001",
		"text" : "飞机票"
	}, {
		"id" : "2-BD0001/1-B10001",
		"text" : "高铁"
	}, {
		"id" : "2-BF0001/1-B10001",
		"text" : "滴滴打车"
	}, {
		"id" : "2-BE0001/1-B10001",
		"text" : "自行车"
	}, {
		"id" : "2-BG0001/1-B10001",
		"text" : "公共交通（地铁，公交）"
	} ]
}, {
	"id" : "1-C10001",
	"text" : "网购消费",
	"children" : [ {
		"id" : "2-CA0001/1-C10001",
		"text" : "手机"
	}, {
		"id" : "2-CB0001/1-C10001",
		"text" : "生活必需品"
	}, {
		"id" : "2-CC0001/1-C10001",
		"text" : "生活奢侈品"
	}, {
		"id" : "2-CD0001/1-C10001",
		"text" : "网上购物"
	}, {
		"id" : "2-CF0001/1-C10001",
		"text" : "网购消费"
	}, {
		"id" : "2-CG0001/1-C10001",
		"text" : "网购书籍"
	} ]
}, {
	"id" : "1-D10001",
	"text" : "电子消费",
	"children" : [ {
		"id" : "2-DA0001/1-D10001",
		"text" : "手机"
	}, {
		"id" : "2-DB0001/1-D10001",
		"text" : "电脑"
	}, {
		"id" : "2-DC0001/1-D10001",
		"text" : "风扇"
	}, {
		"id" : "2-DD0001/1-D10001",
		"text" : "冰箱"
	}, {
		"id" : "2-DE0001/1-D10001",
		"text" : "电饭煲"
	}, {
		"id" : "2-DF0001/1-D10001",
		"text" : "电子设备"
	} ]
}, {
	"id" : "1-E10001",
	"text" : "生活物质",
	"children" : [ {
		"id" : "2-EA0001/1-E10001",
		"text" : "米"
	}, {
		"id" : "2-EB0001/1-E10001",
		"text" : "牛奶"
	}, {
		"id" : "2-EC0001/1-E10001",
		"text" : "清洁用品"
	}, {
		"id" : "2-ED0001/1-E10001",
		"text" : "家庭日用"
	}, {
		"id" : "2-ER0001/1-E10001",
		"text" : "文具用品"
	}, {
		"id" : "2-EF0001/1-E10001",
		"text" : "护肤品"
	}, {
		"id" : "2-EG0001/1-E10001",
		"text" : "水果"
	}, {
		"id" : "2-EH0001/1-E10001",
		"text" : "床上用品"
	}, {
		"id" : "2-EI0001/1-E10001",
		"text" : "菜"
	}, {
		"id" : "2-EJ0001/1-E10001",
		"text" : "米"
	}, {
		"id" : "2-EK0001/1-E10001",
		"text" : "油"
	}, {
		"id" : "2-EL0001/1-E10001",
		"text" : "盐"
	}, {
		"id" : "2-EM0001/1-E10001",
		"text" : "酱"
	}, {
		"id" : "2-EN0001/1-E10001",
		"text" : "醋"
	}, {
		"id" : "2-EO0001/1-E10001",
		"text" : "茶"
	}, {
		"id" : "2-EP0001/1-E10001",
		"text" : "坚果"
	}, {
		"id" : "2-EQ0001/1-E10001",
		"text" : "书籍"
	} ]
}, {
	"id" : "1-F10001",
	"text" : "服装消费",
	"children" : [ {
		"id" : "2-FA0001/1-F10001",
		"text" : "衣服"
	}, {
		"id" : "2-FB0001/1-F10001",
		"text" : "鞋子"
	}, {
		"id" : "2-FC0001/1-F10001",
		"text" : "裤子"
	}, {
		"id" : "2-FD0001/1-F10001",
		"text" : "眼镜"
	} ]
}, {
	"id" : "1-G10001",
	"text" : "银行服务",
	"children" : [ {
		"id" : "2-GA0001/1-G10001",
		"text" : "提现"
	}, {
		"id" : "2-GA0002/1-G10001",
		"text" : "信用卡还款"
	}, {
		"id" : "2-GA0003/1-G10001",
		"text" : "手续费"
	}, {
		"id" : "2-GA0004/1-G10001",
		"text" : "银行短信服务"
	}, {
		"id" : "2-GA0005/1-G10001",
		"text" : "储蓄卡取款"
	}, {
		"id" : "2-GA0006/1-G10001",
		"text" : "储蓄卡存款"
	}, {
		"id" : "2-GA0007/1-G10001",
		"text" : "银行还息"
	}, {
		"id" : "2-GA0008/1-G10001",
		"text" : "转账"
	}, {
		"id" : "2-GA0009/1-G10001",
		"text" : "转入"
	}, {
		"id" : "2-GA0010/1-G10001",
		"text" : "银行管理费"
	}, {
		"id" : "2-GA0011/1-G10001",
		"text" : "银行代收罚款"
	}, {
		"id" : "2-GA0012/1-G10001",
		"text" : "信用卡利息"
	}, {
		"id" : "2-GA0013/1-G10001",
		"text" : "信用卡取现手续费"
	}, {
		"id" : "2-GA0014/1-G10001",
		"text" : "结息"
	} ]
}, {
	"id" : "1-H10001",
	"text" : "培训",
	"children" : [ {
		"id" : "2-HA0001/1-H10001",
		"text" : "韦伯国际英语"
	}, {
		"id" : "2-HA0002/1-H10001",
		"text" : "深圳大学自考"
	}, {
		"id" : "2-HA0003/1-H10001",
		"text" : "网络培训"
	}, {
		"id" : "2-HA0004/1-H10001",
		"text" : "考证"
	}  ]
}, {
	"id" : "1-I10001",
	"text" : "资金来源、流向",
	"children" : [ {
		"id" : "2-IA0001/1-I10001",
		"text" : "个人工资"
	}, {
		"id" : "2-IA0002/1-I10001",
		"text" : "借钱（入）"
	}, {
		"id" : "2-IA0003/1-I10001",
		"text" : "借钱（出）"
	}, {
		"id" : "2-IA0004/1-I10001",
		"text" : "父母赞助"
	}, {
		"id" : "2-IA0005/1-I10001",
		"text" : "政府"
	}, {
		"id" : "2-IA0006/1-I10001",
		"text" : "基金"
	}, {
		"id" : "2-IA0007/1-I10001",
		"text" : "贷款"
	}, {
		"id" : "2-IA0008/1-I10001",
		"text" : "心愿储蓄"
	}, {
		"id" : "2-IA0009/1-I10001",
		"text" : "红包"
	}, {
		"id" : "2-IA0010/1-I10001",
		"text" : "公益"
	} ]
}, {
	"id" : "1-J10001",
	"text" : "报销",
	"children" : [ {
		"id" : "2-JA0001/1-J10001",
		"text" : "餐费补助"
	} ]
}, {
	"id" : "1-K10001",
	"text" : "保险",
	"children" : [ {
		"id" : "2-KA0001/1-K10001",
		"text" : "临时保险"
	} ]
} ];

var consume_operate = {
	find : function(id) {
		if (id != null && id != undefined && $.trim(id) != '') {
			var consumeTarget = null;
			for (var i = 0; i < consume_datasource.length; i++) {
				var consumeP = consume_datasource[i];
				if (id.indexOf(consumeP.id) > -1) {
					var consumeChildren = consumeP.children;
					for (var j = 0; j < consumeChildren.length; j++) {
						var consumeC = consumeChildren[j];
						if (id == consumeC.id) {
							consumeTarget = consumeC;
							break;
						}
					}
					break;
				}
			}
		}
		return consumeTarget;
	}
}